test/jmeter/reporte-html/statistics.json
{
  "P4 - Actualizar Producto" : {
    "transaction" : "P4 - Actualizar Producto",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 828.3012048192774,
    "medianResTime" : 614.0,
    "minResTime" : 106.0,
    "maxResTime" : 6544.0,
    "pct1ResTime" : 1495.0,
    "pct2ResTime" : 3129.5,
    "pct3ResTime" : 5205.5,
    "throughput" : 3.021441312446154,
    "receivedKBytesPerSec" : 1.5461281716033053,
    "sentKBytesPerSec" : 1.2510655434347355
  },
  "L4 - Actualizar lista" : {
    "transaction" : "L4 - Actualizar lista",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 726.8152610441767,
    "medianResTime" : 595.0,
    "minResTime" : 91.0,
    "maxResTime" : 5798.0,
    "pct1ResTime" : 1222.0,
    "pct2ResTime" : 1873.5,
    "pct3ResTime" : 5276.0,
    "throughput" : 2.896965748324646,
    "receivedKBytesPerSec" : 1.6318610241762845,
    "sentKBytesPerSec" : 1.1740632671432893
  },
  "R4 - Marcar Leido" : {
    "transaction" : "R4 - Marcar Leido",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 841.3212851405624,
    "medianResTime" : 719.0,
    "minResTime" : 6.0,
    "maxResTime" : 4451.0,
    "pct1ResTime" : 1360.0,
    "pct2ResTime" : 1812.0,
    "pct3ResTime" : 3793.0,
    "throughput" : 3.476633948143701,
    "receivedKBytesPerSec" : 1.2120686713743176,
    "sentKBytesPerSec" : 1.269786227154047
  },
  "[SETUP] A1 - Registrar usuario" : {
    "transaction" : "[SETUP] A1 - Registrar usuario",
    "sampleCount" : 1,
    "errorCount" : 1,
    "errorPct" : 100.0,
    "meanResTime" : 5.0,
    "medianResTime" : 5.0,
    "minResTime" : 5.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 200.0,
    "receivedKBytesPerSec" : 219.7265625,
    "sentKBytesPerSec" : 0.0
  },
  "R3 - No leidos" : {
    "transaction" : "R3 - No leidos",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1148.5381526104425,
    "medianResTime" : 834.0,
    "minResTime" : 3.0,
    "maxResTime" : 7744.0,
    "pct1ResTime" : 1857.0,
    "pct2ResTime" : 4256.5,
    "pct3ResTime" : 6084.0,
    "throughput" : 3.2478966934063784,
    "receivedKBytesPerSec" : 1.33214512815496,
    "sentKBytesPerSec" : 1.1291515848170612
  },
  "P5 - Eliminar Producto" : {
    "transaction" : "P5 - Eliminar Producto",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 947.293172690763,
    "medianResTime" : 657.0,
    "minResTime" : 14.0,
    "maxResTime" : 7603.0,
    "pct1ResTime" : 2059.0,
    "pct2ResTime" : 3233.5,
    "pct3ResTime" : 6268.5,
    "throughput" : 3.0191699101524136,
    "receivedKBytesPerSec" : 1.0525816971918083,
    "sentKBytesPerSec" : 1.1203950838456223
  },
  "S1 - Estadisticas" : {
    "transaction" : "S1 - Estadisticas",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1273.1767068273093,
    "medianResTime" : 1287.0,
    "minResTime" : 99.0,
    "maxResTime" : 2523.0,
    "pct1ResTime" : 1773.0,
    "pct2ResTime" : 2015.0,
    "pct3ResTime" : 2388.5,
    "throughput" : 3.84395696003211,
    "receivedKBytesPerSec" : 140.21647705782917,
    "sentKBytesPerSec" : 1.2725599701668802
  },
  "L3 - Obtener lista por ID" : {
    "transaction" : "L3 - Obtener lista por ID",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 857.9156626506023,
    "medianResTime" : 620.0,
    "minResTime" : 86.0,
    "maxResTime" : 6544.0,
    "pct1ResTime" : 1685.0,
    "pct2ResTime" : 2600.0,
    "pct3ResTime" : 5434.5,
    "throughput" : 2.8163279155780256,
    "receivedKBytesPerSec" : 1.5251906358510627,
    "sentKBytesPerSec" : 0.9461101591394931
  },
  "L1 - Crear lista" : {
    "transaction" : "L1 - Crear lista",
    "sampleCount" : 251,
    "errorCount" : 2,
    "errorPct" : 0.7968128,
    "meanResTime" : 872.0278884462153,
    "medianResTime" : 699.0,
    "minResTime" : 8.0,
    "maxResTime" : 4667.0,
    "pct1ResTime" : 1552.400000000001,
    "pct2ResTime" : 2356.7999999999997,
    "pct3ResTime" : 3659.1199999999953,
    "throughput" : 2.836831338509703,
    "receivedKBytesPerSec" : 1.5515687338238453,
    "sentKBytesPerSec" : 1.1076405665468643
  },
  "U1 - Actualizar Perfil" : {
    "transaction" : "U1 - Actualizar Perfil",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 701.0803212851413,
    "medianResTime" : 668.0,
    "minResTime" : 5.0,
    "maxResTime" : 1903.0,
    "pct1ResTime" : 1160.0,
    "pct2ResTime" : 1399.5,
    "pct3ResTime" : 1685.5,
    "throughput" : 3.7516385168221063,
    "receivedKBytesPerSec" : 1.7762369860330567,
    "sentKBytesPerSec" : 1.4465031320154889
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4238,
    "errorCount" : 3,
    "errorPct" : 0.07078811,
    "meanResTime" : 1060.3043888626692,
    "medianResTime" : 748.0,
    "minResTime" : 3.0,
    "maxResTime" : 9329.0,
    "pct1ResTime" : 1968.5999999999995,
    "pct2ResTime" : 3096.149999999999,
    "pct3ResTime" : 6448.439999999999,
    "throughput" : 44.767920900851415,
    "receivedKBytesPerSec" : 18797.284602081265,
    "sentKBytesPerSec" : 16.25204006718357
  },
  "P2 - Agregar Producto" : {
    "transaction" : "P2 - Agregar Producto",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 573.8232931726906,
    "medianResTime" : 471.0,
    "minResTime" : 54.0,
    "maxResTime" : 3942.0,
    "pct1ResTime" : 914.0,
    "pct2ResTime" : 1435.5,
    "pct3ResTime" : 3300.5,
    "throughput" : 2.92700129305278,
    "receivedKBytesPerSec" : 1.466359046226637,
    "sentKBytesPerSec" : 1.249120669007876
  },
  "A2 - Login (extraer token)" : {
    "transaction" : "A2 - Login (extraer token)",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 653.1079999999995,
    "medianResTime" : 485.5,
    "minResTime" : 86.0,
    "maxResTime" : 3504.0,
    "pct1ResTime" : 1222.1000000000001,
    "pct2ResTime" : 2268.0999999999985,
    "pct3ResTime" : 3325.2200000000025,
    "throughput" : 2.8157909556794505,
    "receivedKBytesPerSec" : 1.8202878618291378,
    "sentKBytesPerSec" : 0.7094473306301741
  },
  "R5 - Eliminar Recordatorio" : {
    "transaction" : "R5 - Eliminar Recordatorio",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 716.0160642570285,
    "medianResTime" : 680.0,
    "minResTime" : 6.0,
    "maxResTime" : 1922.0,
    "pct1ResTime" : 1189.0,
    "pct2ResTime" : 1330.0,
    "pct3ResTime" : 1626.0,
    "throughput" : 3.706736136955713,
    "receivedKBytesPerSec" : 1.2922898446222553,
    "sentKBytesPerSec" : 1.339348018235951
  },
  "R2 - Obtener Recordatorios" : {
    "transaction" : "R2 - Obtener Recordatorios",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2391.566265060242,
    "medianResTime" : 1731.0,
    "minResTime" : 568.0,
    "maxResTime" : 9329.0,
    "pct1ResTime" : 5689.0,
    "pct2ResTime" : 6626.0,
    "pct3ResTime" : 8370.5,
    "throughput" : 3.0964372318597277,
    "receivedKBytesPerSec" : 21055.73931907915,
    "sentKBytesPerSec" : 1.0371855180936391
  },
  "R1 - Crear Recordatorio" : {
    "transaction" : "R1 - Crear Recordatorio",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2326.1686746987953,
    "medianResTime" : 1529.0,
    "minResTime" : 670.0,
    "maxResTime" : 8771.0,
    "pct1ResTime" : 6392.0,
    "pct2ResTime" : 7510.5,
    "pct3ResTime" : 8654.0,
    "throughput" : 2.9984826955034802,
    "receivedKBytesPerSec" : 459.1680170124756,
    "sentKBytesPerSec" : 1.2556710760819827
  },
  "L2 - Obtener listas" : {
    "transaction" : "L2 - Obtener listas",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1845.0279999999984,
    "medianResTime" : 1455.5,
    "minResTime" : 739.0,
    "maxResTime" : 5060.0,
    "pct1ResTime" : 3402.5,
    "pct2ResTime" : 4397.349999999999,
    "pct3ResTime" : 5033.33,
    "throughput" : 2.8163302090843545,
    "receivedKBytesPerSec" : 422.82897685187794,
    "sentKBytesPerSec" : 0.9323593172652307
  },
  "P3 - Obtener Productos" : {
    "transaction" : "P3 - Obtener Productos",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 624.7389558232928,
    "medianResTime" : 467.0,
    "minResTime" : 63.0,
    "maxResTime" : 6267.0,
    "pct1ResTime" : 1091.0,
    "pct2ResTime" : 1683.5,
    "pct3ResTime" : 4833.5,
    "throughput" : 3.009063444108761,
    "receivedKBytesPerSec" : 1.513347337613293,
    "sentKBytesPerSec" : 1.0373040974320242
  },
  "L5 - Eliminar Lista (cleanup)" : {
    "transaction" : "L5 - Eliminar Lista (cleanup)",
    "sampleCount" : 249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 702.4899598393575,
    "medianResTime" : 704.0,
    "minResTime" : 6.0,
    "maxResTime" : 1877.0,
    "pct1ResTime" : 1231.0,
    "pct2ResTime" : 1448.5,
    "pct3ResTime" : 1687.0,
    "throughput" : 3.9337114330400165,
    "receivedKBytesPerSec" : 1.3714208804641463,
    "sentKBytesPerSec" : 1.4059945161060996
  }
}